[
	{
		"title": "The DubLAN",
		"body": "TU DubLAN was an event originally envisioned by David Corcoran in 2023 in his first year as Chair of esports Society. He wanted a multi-day competition on-campus where people could bring their own devices, or rent them. The concept was a national-level tournament with games being hosted on-site and everyone being networked together. This is an awesome event, and I'd love to help out if someone wants to take it on!"
	},
	{
		"title": "Linus Torvalds",
		"body": "Arguably one of the most important names in Computing, Linux Torvalds would be an amazing speaking to have on-campus and would garner a MASSIVE audience. If you invite him, please let me know so I can come along!"
	},
	{
		"title": "Assassin",
		"body": "As a charitable endeavour, anyone who pays in gets a water pistol and their photo taken. They are randomly given another person on the same campus. If they manage to assassinate that person, they get the target that person was holding. Repeat until there is just one winner."
	},
	{
		"title": "Mystery Trip (but done properly)",
		"body": "Work with an airline (or do this alone) to plan a mystery trip. People pay and only find out where they're going when they land at the destination. They are only told what to pack."
	},
	{
		"title": "24-Hour Plays",
		"body": "Ala Fishamble 24-hour plays. Actors and Directors and Writers meet up to introduce themselves, give a prop, a costume, a skill they have & something they've always wanted to do on-stage. Within 24-hours of the end of that meeting, the script is written, rehearsals and tech are done, and the show is performed."
	},
	{
		"title": "24-Hour Hackathon",
		"body": "Intersociety collaboration, 24-hour hackathon"
	},
	{
		"title": "Scan-Card attendance box",
		"body": "Little box that students scan their student card on. Adds them to the attendance for that event w/o having to deal with manually entering it into the portal or dealing with handwriting issues"
	},
	{
		"title": "Digital Wallet Membership Badges",
		"body": "Every SLG you're a member of gives you an Apple Wallet / Google Pay ticket that they can use to be registered as a member / avail of things"
	},
	{
		"title": "The Chase",
		"body": "Teams of students compete against lecturers (Chasers) in a Chase-style event"
	},
	{
		"title": "Useless Hackathon",
		"body": "Compete to create something useless. Most useless creation wins!"
	}
]
